Revit 2016 API
ProjectInfo Properties
The ProjectInfo type exposes the following members.
Properties
Name | Description
Address
Get or Set the Project Address of the Project Information.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
Author
Get or Set the Project Author of the Project Information.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
BuildingName
Get or Set the Building Name of the Project Information.
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
ClientName
Get or Set the Client Name of the Project Information.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IssueDate
Get or Set the Project Issue Date of the Project Information.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
Get or Set the Project Name of the Project Information.
Number
Get or Set the Project Number of the Project Information.
OrganizationDescription
Get or Set the Organization Description of the Project Information.
OrganizationName
Get or Set the Organization Name of the Project Information.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Status
Get or Set the Project Status of the Project Information.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
ProjectInfo Class
Autodesk.Revit.DB Namespace